In [6]:
# Math and Data
import pandas as pd
import numpy as np
# Downloads and files
import requests
import os
# Graphs and Clusters
import matplotlib.pyplot as plt
import seaborn as sns
import sklearn.cluster as cluster
import time

In [8]:
players = pd.read_csv('player_data.csv')

In [9]:
players.head()

,name,year_start,year_end,position,height,weight,birth_date,college
0,Alaa Abdelnaby,1991,1995,F-C,6-10,240.0,"June 24, 1968",Duke University
1,Zaid Abdul-Aziz,1969,1978,C-F,6-9,235.0,"April 7, 1946",Iowa State University
2,Kareem Abdul-Jabbar,1970,1989,C,7-2,225.0,"April 16, 1947","University of California, Los Angeles"
3,Mahmoud Abdul-Rauf,1991,2001,G,6-1,162.0,"March 9, 1969",Louisiana State University
4,Tariq Abdul-Wahad,1998,2003,F,6-6,223.0,"November 3, 1974",San Jose State University

In [10]:
players.dtypes

name           object
year_start      int64
year_end        int64
position       object
height         object
weight        float64
birth_date     object
college        object
dtype: object

In [28]:
players.year_end.drop_duplicates().sort_values()

144    1947
8      1948
161    1949
300    1950
126    1951
195    1952
358    1953
11     1954
101    1955
130    1956
7      1957
141    1958
325    1959
72     1960
37     1961
114    1962
534    1963
590    1964
360    1965
131    1966
983    1967
13     1968
33     1969
76     1970
78     1971
60     1972
163    1973
132    1974
17     1975
80     1976
       ...
2      1989
57     1990
36     1991
103    1992
12     1993
28     1994
0      1995
20     1996
22     1997
84     1998
67     1999
104    2000
3      2001
47     2002
4      2003
115    2004
43     2005
97     2006
113    2007
5      2008
10     2009
46     2010
27     2011
29     2012
34     2013
58     2014
25     2015
19     2016
32     2017
9      2018
Name: year_end, Length: 72, dtype: int64